In [11]:
import pandas as pd

a=pd.Series([150,151,152,155])#,index=["2018","2019","2020","2021"])
print(a)

b=pd.Series([150,151,152,155],index=["2018","2019","2020","2021"])
print(b)

0    150
1    151
2    152
3    155
dtype: int64
2018    150
2019    151
2020    152
2021    155
dtype: int64

In [26]:
import pandas as pd

Yeong=pd.Series([143,150,157,160],index=["2018","2019","2020","2021"])

Cheol=pd.Series([165,172,175,180],index=["2018","2019","2020","2021"])

pd.DataFrame({'영희': Yeong , '철수': Cheol})

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [20]:
import pandas as pd

Yeong=pd.Series([143,150,157,160],index=["2018","2019","2020","2021"])

Cheol=pd.Series([165,172,175,180],index=["0","1","2","3"])

pd.DataFrame({'영희': Yeong , '철수': Cheol})

         영희     철수
0       NaN  165.0
1       NaN  172.0
2       NaN  175.0
2018  143.0    NaN
2019  150.0    NaN
2020  157.0    NaN
2021  160.0    NaN
3       NaN  180.0

In [23]:
import pandas as pd

index=["2018","2019","2020","2021"]

Yeong=pd.Series([143,150,157,160],index=index)
Cheol=pd.Series([165,172,175,180],index=index)
A=pd.DataFrame({'영희': Yeong , '철수': Cheol})

       영희   철수
2018  143  165
2019  150  172

In [25]:
import pandas as pd

index=["2018","2019","2020","2021"]

Yeong=pd.Series([143,150,157,160],index=index)
Cheol=pd.Series([165,172,175,180],index=index)
A=pd.DataFrame({'영희': Yeong , '철수': Cheol})
A.head(0)

Empty DataFrame
Columns: [영희, 철수]
Index: []